define(
   ({
    _widgetLabel: "Συν.Καταγρ",
    streamControls: "Στοιχεία ελέγχου ροής",
    streamFilter: "Φίλτρο",
    startStreaming: "Έναρξη συν.καταγ",
    stopStreaming: "Διακοπή ροής",
    streamLayers: "Θεματικά επίπεδα ροής",
    startStopStream: "Ενεργοποίηση επιλογής Διακοπή ροής ή Έναρξη ροής",
    clearStream: "Ενεργοποίηση επιλογής Απαλοιφή προηγούμενων παρατηρήσεων",
    attributeFilter: "Ενεργοποίηση Φίλτρου περιγραφικών γνωρισμάτων",
    spatialFilter: "Ενεργοποίηση Χωρικού φίλτρου",
    name: "Όνομα",
    configFilter: "Διαμόρφωση Φίλτρου περιγραφικών γνωρισμάτων ροής",
    drawPrevious: "Ενεργοποίηση επιλογής Σχεδίαση προηγούμενων παρατηρήσεων",
    addNew: "Προσθήκη Φίλτρου",
    setFilterName: "Ορίστε όνομα φίλτρου",
    filterNameExists: "Το όνομα φίλτρου υπάρχει στον πίνακα!",
    invalidFilterName: "Το όνομα πρέπει να είναι λέξη που περιέχει a-z, A-Z, 0-9 ή _.",
    noFilterTip: "Δεν έχει διαμορφωθεί φίλτρο",
    addFilterFailed: "Απέτυχε η προσθήκη φίλτρου",
    filterName: "Όνομα φίλτρου",
    limitMapExtent: "Περιορισμός παρατηρήσεων στην τρέχουσα περιοχή χάρτη",
    limitDrawExtent: "Περιορισμός παρατηρήσεων στην περιοχή η οποία έχει οριστεί από το χρήστη",
    newFilter: "Νέο φίλτρο",
    filterReadOnly: "Το φίλτρο που μεταβιβάστηκε από τον web χάρτη είναι μόνο για ανάγνωση."
  })
);
