define(
   ({
    page1: {
      selectToolHeader: "בחר שיטה לבחירת רשומות לצורך עדכון באצווה.",
      selectToolDesc: "היישומון תומך ב-3 שיטות ליצירת סט נבחר של רשומות לעדכון. באפשרותך לבחור רק באחת מהשיטות. אם נדרשות לך שיטות נוספות, צור מופע חדש של היישומון.",
      selectByShape: "בחר לפי שטח",
      selectBySpatQuery: "בחר לפי ישות",
      selectByAttQuery: "בחר לפי ישות וישויות המקושרות אליה",
      selectByQuery: "בחירה לפי שאילתא",
      toolNotSelected: "בחר שיטת בחירה"
    },
    page2: {
      layersToolHeader: "בחר את השכבות שיש לעדכן ואת האפשרויות בכלי הבחירה, אם קיימות.",
      layersToolDesc: "שיטת הבחירה שבחרת בדף הראשון תשמש לבחירה ועדכון של סט השכבות המפורט להלן:  אם תבדוק יותר משכבה אחת, רק השדות המשותפים הניתנים לעריכה יהיו זמינים לעדכון.  תידרש לבחור אפשרויות נוספות, בהתאם לכלי הבחירה שבחרת.",
      layerTable: {
        colUpdate: "עדכן",
        colLabel: "שכבה",
        colSelectByLayer: "בחר לפי שכבה",
        colSelectByField: "שדה שאילתא",
        colhighlightSymbol: "הדגש סמל"
      },
      toggleLayers: "עבור בין מצב פתוח לסגור בנראות השכבות",
      noEditableLayers: "לא נמצאו שכבות הניתנות לעריכה",
      noLayersSelected: "בחר שכבה אחת או יותר לפני שתמשיך"
    },
    page3: {
      commonFieldsHeader: "בחר את השדות שיש לעדכן באצווה.",
      commonFieldsDesc: "רק השדות המשותפים הניתנים לעריכה יוצגו להלן.  בחר את השדות שברצונך לעדכן.  אם לשדה מסוים הוגדר דומה שונה בשכבות שונות, רק דומיין אחד יוצג ורק בו יעשה שימוש.",
      noCommonFields: "אין שדות משותפים",
      fieldTable: {
        colEdit: "ניתן לעריכה",
        colName: "שם",
        colAlias: "כינוי",
        colAction: "פעולה"
      }
    },
    tabs: {
      selection: "הגדר סוג בחירה",
      layers: "הגדר שכבות לעדכון",
      fields: "הגדר שדות לעדכון"
    },
    errorOnOk: "מלא את כל הפרמטרים לפני שמירת הגדרה",
    next: "הבא",
    back: "אחורה",
    save: "שמור סמל",
    cancel: "ביטול",
    ok: "אישור",
    symbolPopup: "בוחר הסמלים"
  })
);
