define(
   ({
    _widgetLabel: "Ανάλυση",
    executeAnalysisTip: "Κάντε κλικ σε ένα εργαλείο ανάλυσης για εκτέλεση",
    noToolTip: "Δεν έχει επιλεγεί εργαλείο ανάλυσης!",
    back: "Επιστροφή",
    next: "Επόμενο",
    home: "Αρχική",
    jobSubmitted: "υποβλήθηκε.",
    jobCancelled: "Ακυρώθηκε.",
    jobFailed: "Αποτυχία",
    jobSuccess: "Επιτυχία.",
    executing: "Εκτέλεση",
    cancelJob: "Ακύρωση της εργασίας ανάλυσης",
    paramName: "Όνομα παραμέτρου",
    link: "Σύνδεσμος",
    learnMore: "Μάθετε περισσότερα",
    messages: "Μηνύματα",
    outputs: "Έξοδοι",
    outputtip: "Σημείωση: Οι έξοδοι στοιχείων και πινάκων προστίθενται στο χάρτη ως επιχειρησιακά θεματικά επίπεδα.",
    outputSaveInPortal: "Τα δεδομένα έχουν αποθηκευτεί στην πύλη σας.",
    privilegeError: "Θα πρέπει να έχετε ρόλο Χρήστη για δημοσιεύσεις ή Διαχειριστή για να εκτελέσετε το εργαλείο ανάλυσης."
  })
);
