define(
   ({
    placeholder: "Замещающий текст",
    url: "URL-адрес геокодера",
    name: "Имя геокодера",
    example: "Пример",
    singleLineFieldName: "SingleLineFieldName",
    portalConnectionError: 'Не возможно получить конфигурацию геокодера из портала',
    actions: "Действия",
    warning: "Некорректный сервис",
    instruction: "Определите геокодеры, которые будут применяться в виджете. Щелкните Добавить геокодер, чтобы указать его URL, введите имя пользователя и настройте другие свойства. Ниже вы также можете изменить порядок, настройки или удалить геокодеры.",
    add: "Добавить геокодер",
    edit: "Изменить геокодер",
    ok: "OK",
    cancel: "Отмена",
    geocoderNamePlaceHolder: "Мой геокодер",
    geocodePlaceHolder: "Найти адрес или место",
    REPEATING_ERROR: "Следующие поля повторяются: "
  })
);