define(
   ({
    _widgetLabel: "วิเคราะห์",
    executeAnalysisTip: "คลิกเครื่องมือวิเคราะห์เพื่อดำเนินงาน",
    noToolTip: "ไม่ได้เลือกเครื่องมือที่ใช้วิเคราะห์!",
    back: "กลับ",
    next: "ถัดจาก",
    home: "บ้าน",
    jobSubmitted: "ส่ง",
    jobCancelled: "ยกเลิก",
    jobFailed: "ล้มเหลว",
    jobSuccess: "สำเร็จ",
    executing: "กำลังดำเนินงาน",
    cancelJob: "ยกเลิกการวิเคราะห์",
    paramName: "ชื่อพารามิเตอร์",
    link: "ลิงค์",
    learnMore: "เรียนรู้เพิ่มเติม",
    messages: "ข้อความ",
    outputs: "ผลลัพธ์",
    outputtip: "หมายเหตุ: ฟีเจอร์และตารางผลลัพธ์ถูกเพิ่มในแผนที่เป็นชั้นข้อมูลปฏิบัติการ",
    outputSaveInPortal: "ข้อมูลนี้ไม่ได้ถูกจัดเก็บในพอร์ทัลของคุณ",
    privilegeError: "คุณต้องมีคนที่ทำหน้าที่เป็นผู้ดูแลระบบเพื่อใช้งานเครื่องมือวิเคราะห์"
  })
);
