define(
   ({
    settingsHeader : "Καθορίστε τις λεπτομέρειες για το GeoLookup Widget",
    settingsDesc : "Εμπλουτίστε γεωγραφικά μια λίστα τοποθεσιών από ένα αρχείο CSV σε σχέση με πολυγωνικά θεματικά επίπεδα στον χάρτη. Τα επιλεγμένα πεδία από τα πολυγωνικά θεματικά επίπεδα προσαρτώνται στις τοποθεσίες.",
    settingsLoadingLayers: "Περιμένετε μέχρι να φορτωθούν τα θεματικά επίπεδα.",
    settingsConfigureTitle: "Διαμόρφωση πεδίων θεματικού επιπέδου",
    layerTable : {
      colEnrich : "Εμπλουτισμός",
      colLabel : "Θεματικό επίπεδο",
      colFieldSelector : "Πεδία"
    },
    fieldTable : {
      colAppend : "Προσάρτηση",
      colName : "Όνομα",
      colAlias : "Ψευδώνυμο",
      colOrder : "Σειρά",
      label : "Επιλέξτε το πεδίο που θέλετε να προσαρτήσετε. Επιλέξτε ένα πεδίο, για να αλλάξετε το ψευδώνυμο, για να το τοποθετήσετε σε σειρά ή για να το μορφοποιήσετε."
    },
    symbolArea : {
      symbolLabelWithin : 'Επιλέξτε το σύμβολο για τοποθεσίες εντός:',
      symbolLabelOutside : 'Επιλέξτε το σύμβολο για τοποθεσίες εκτός:'
    },
    advSettings : {
      label: "Ρυθμίσεις για προχωρημένους",
      latFieldsDesc : "Πιθανά ονόματα πεδίου για το πεδίο \"Γεωγραφικό πλάτος\".",
      longFieldsDesc : "Πιθανά ονόματα πεδίου για το πεδίο \"Γεωγραφικό μήκος\".",
      intersectFieldDesc : "Το όνομα του πεδίου που δημιουργήθηκε για την αποθήκευση της τιμής εάν η αναζήτηση συναντήσει ένα θεματικό επίπεδο.",
      intersectInDesc : "Η τιμή που θα αποθηκευτεί εάν η τοποθεσία συναντήσει ένα πολύγωνο.",
      intersectOutDesc : "Η τιμή που θα αποθηκευτεί εάν η τοποθεσία δεν συναντήσει ένα πολύγωνο.",
      maxRowCount : "Ο μέγιστος αριθμός σειρών σε ένα αρχείο CSV.",
      cacheNumberDesc : "Όριο συστάδας σημείων για πιο γρήγορη επεξεργασία.",
      subTitle : "Καθορίστε τιμές για το αρχείο CSV."
    },
    noPolygonLayers : "Δεν υπάρχουν πολυγωνικά θεματικά επίπεδα",
    errorOnOk : "Συμπληρώστε όλες τις παραμέτρους προτού αποθηκεύσετε τη διαμόρφωση",
    saveFields : "Αποθήκευση πεδίων",
    cancelFields : "Ακύρωση πεδίων",
    saveAdv : "Αποθήκευση σύνθ. Ρυθμίσεις",
    cancelAdv : "Ακύρωση σύνθ. Ρυθμίσεις",
    advSettingsBtn : "Ρυθμίσεις για προχωρημένους",
    chooseSymbol: "Επιλέξτε ένα σύμβολο",
    okBtn: "OK",
    cancelBtn: "Ακύρωση"
  })
);
