define(
   ({
    _widgetLabel: "Поток",
    streamControls: "Управление потоковой передачей",
    streamFilter: "Фильтр",
    startStreaming: "Начать работу в потоковом режиме",
    stopStreaming: "Прекратить работу в потоковом режиме",
    streamLayers: "Слои потоков",
    startStopStream: "Включить опцию Начать или Остановить потоковую запись",
    clearStream: "Включить опцию Очистить предыдущие наблюдения",
    attributeFilter: "Включить Фильтр по атрибуту",
    spatialFilter: "Включить Пространственный фильтр",
    name: "Имя",
    configFilter: "Настроить фильтр потока атрибутов.",
    drawPrevious: "Включить опцию Отобразить предыдущие наблюдения",
    addNew: "Добавить фильтр",
    setFilterName: "Задать Имя фильтра",
    filterNameExists: "Имя фильтра уже существует в таблице!",
    invalidFilterName: "Имя должно быть словом, содержащим с a-z, A-Z, 0-9 или _.",
    noFilterTip: "Нет настроенного фильтра",
    addFilterFailed: "Не удалось добавить фильтр",
    filterName: "Имя фильтра",
    limitMapExtent: "Ограничить наблюдения текущей областью карты",
    limitDrawExtent: "Ограничить наблюдения заданной пользователем областью",
    newFilter: "Новый фильтр",
    filterReadOnly: "Фильтр с веб-карты доступен только для чтения."
  })
);
