define(
   ({
    placeholder: "ตัวอักษรที่จองที่ไว้สำหรับคำที่ใช้งานจริง",
    url: "URL เครื่องระบุตำแหน่ง",
    name: "ชื่อเครื่องมือระบุตำแหน่ง",
    example: "ตัวอย่าง",
    singleLineFieldName: "ชื่อฟิลด์ข้อมูลเส้นเชิงเดี่ยว",
    portalConnectionError: 'ไม่สามารถรับการปรับตั้งค่าของ Geocode จากพอร์ทัลได้',
    actions: "กระทำ",
    warning: "เซอร์วิสที่ไม่ถูกต้อง",
    instruction: "ติดตั้ง Geocoder ที่จะนำไปใช้กับ widget นี้ คลิกเพิ่ม Geocoder เพื่ออ้างอิง URL ระบุชื่อผู้ใช้งาน และตั้งค่าคุณสมบัติอื่นๆ  คุณยังสามารถเรียงลำดับ ปรับตั้งค่า หรือลบ Geocoder ด้านล่างของคุณได้",
    add: "เพิ่มเครื่องมือระบุพิกัดจากชื่อสถานที่",
    edit: "แก้ไข Geocoder",
    ok: "ตกลง",
    cancel: "ยกเลิก",
    geocoderNamePlaceHolder: "เครื่องมือระบุตำแหน่งของฉัน",
    geocodePlaceHolder: "ค้นหาที่อยู่หรือสถานที่",
    REPEATING_ERROR: "ฟิลด์ต่อไปนี้มีการทำซ้ำ: "
  })
);