define(
   ({
    placeholder: "نص العنصر النائب",
    url: "عنوان URL للمكود الجغرافي",
    name: "اسم المكود الجغرافي",
    example: "مثال",
    singleLineFieldName: "SingleLineFieldName",
    portalConnectionError: 'يتعذر الحصول على تكوينات المُكود الجغرافي من المدخل',
    actions: "الأفعال",
    warning: "خدمة غير صحيحة",
    instruction: "تأسيس المُكودات الجغرافية في عنصر واجهة الاستخدام الحالية. انقر على إضافة مُكود جغرافي لإرجاع عنوان URL وتحديد اسم للمستخدم وتعيين الخصائص الأخرى. يمكن أيضًا إعادة ترتيب المكودات الجغرافية الموضحة أدناه أو تكوينها أو حذفها.",
    add: "إضافة مكود جغرافي",
    edit: "تحرير المكود الجغرافي",
    ok: "موافق",
    cancel: "إلغاء الأمر",
    geocoderNamePlaceHolder: "المُكود الجغرافي",
    geocodePlaceHolder: "العثور على عنوان أو مكان",
    REPEATING_ERROR: "الحقول التالية مُكررة: "
  })
);