define(
   ({
    page1: {
      selectToolHeader: "Διαλέξτε μια μέθοδο επιλογής εγγραφών για μαζική ενημέρωση.",
      selectToolDesc: "Το widget υποστηρίζει 3 μεθόδους για τη δημιουργία ενός επιλεγμένου συνόλου εγγραφών προς ενημέρωση. Μπορείτε να επιλέξετε μόνο μία. Εάν θέλετε περισσότερες από μία μεθόδους, δημιουργήστε μια νέα παρουσία του widget.",
      selectByShape: "Επιλογή ανά περιοχή",
      selectBySpatQuery: "Επιλογή ανά στοιχείο",
      selectByAttQuery: "Επιλογή ανά στοιχείο και συσχατιζόμενα στοιχεία",
      selectByQuery: "Επιλογή ανά ερώτημα",
      toolNotSelected: "Επιλέξτε μια μέθοδο επιλογής"
    },
    page2: {
      layersToolHeader: "Επιλέξτε τα θεματικά πεδία για ενημέρωση και επιλογές του Εργαλείου επιλογής, εάν υπάρχουν.",
      layersToolDesc: "Η μέθοδος επιλογής που επιλέξατε στη σελίδα ένα θα χρησιμοποιηθεί για την επιλογή και την ενημέρωση ενός συνόλου θεματικών πεδίων που παρατίθενται παρακάτω.  Εάν επιλέξετε περισσότερα από ένα θεματικά επίπεδα, μόνο τα κοινά επεξεργάσιμα πεδία θα είναι διαθέσιμα για ενημέρωση.  Ανάλογα με το εργαλείο επιλογής που επιλέγετε, θα απαιτηθούν πρόσθετες ρυθμίσεις.",
      layerTable: {
        colUpdate: "Ενημέρωση",
        colLabel: "Θεματικό επίπεδο",
        colSelectByLayer: "Επιλογή ανά θεματικό επίπεδο",
        colSelectByField: "Πεδίο ερωτήματος",
        colhighlightSymbol: "Σύμβολο επισήμανσης"
      },
      toggleLayers: "Εναλλαγή της ορατότητας των θεματικών επιπέδων κατά το άνοιγμα και το κλείσιμο",
      noEditableLayers: "Δεν υπάρχουν θεματικά επίπεδα με δυνατότητα επεξεργασίας",
      noLayersSelected: "Επιλέξετε ένα ή περισσότερα θεματικά επίπεδα προτού συνεχίσετε"
    },
    page3: {
      commonFieldsHeader: "Επιλέξτε τα πεδία για μαζική ενημέρωση.",
      commonFieldsDesc: "Μόνο τα κοινά θεματικά επίπεδα με δυνατότητα επεξεργασίας θα εμφανιστούν παρακάτω.  Επιλέξτε τα πεδία που θέλετε να ενημερώσετε.  Εάν το ίδιο πεδίο από διαφορετικά θεματικά επίπεδα έχει διαφορετικούς τομείς, μόνο ένας τομέας θα εμφανιστεί και θα χρησιμοποιηθεί.",
      noCommonFields: "Δεν υπάρχουν κοινά πεδία",
      fieldTable: {
        colEdit: "Επεξεργάσιμο",
        colName: "Όνομα",
        colAlias: "Ψευδώνυμο",
        colAction: "Ενέργεια"
      }
    },
    tabs: {
      selection: "Ορισμός τύπου επιλογής",
      layers: "Ορισμός θεματικών επιπέδων για ενημέρωση",
      fields: "Ορισμός πεδίων για ενημέρωση"
    },
    errorOnOk: "Συμπληρώστε όλες τις παραμέτρους προτού αποθηκεύσετε τη διαμόρφωση",
    next: "ΕΠΟΜΕΝΟ",
    back: "Πίσω",
    save: "Αποθήκευση συμβόλου",
    cancel: "Ακύρωση",
    ok: "OK",
    symbolPopup: "Επιλογέας συμβόλων"
  })
);
